kokoory/mm-iot-esp32/esp32p4halow/sdkconfig.defaults.esp32p4
#
# ESP32-P4 HaLow Pin Configuration
#
# Available GPIOs: 2,3,4,5,7,8,20,21,22,23,24,25,26,27,28,29,30,31,32,33,
#                  46,47,48,49,50,51,52
#

# HaLow SPI pins
CONFIG_MM_RESET_N=20
CONFIG_MM_WAKE=23
CONFIG_MM_BUSY=32
CONFIG_MM_SPI_SCK=5
CONFIG_MM_SPI_MOSI=3
CONFIG_MM_SPI_MISO=2
CONFIG_MM_SPI_CS=4
CONFIG_MM_SPI_IRQ=21
CONFIG_MM_BCF_FILE="bcf_fgh100mhaamd.mbin"

CONFIG_IDF_TARGET="esp32p4"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_MBEDTLS_NIST_KW_C=y
